tap "homebrew/bundle"
tap "homebrew/services"
tap "cloudflare/cloudflare"
tap "heroku/brew"

brew "autoconf"
brew "automake"
brew "cmake"
brew "deno"
brew "direnv"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew 'grep'
brew "heroku"
brew "hyperfine"
brew "imagemagick"
brew "make"
brew "mise"
brew "mpv"
brew "nginx", restart_service: true
brew "neovim"
brew "ollama", restart_service: true
brew "pandoc"
brew "poppler"
brew "postgresql@15", restart_service: true
brew "redis", restart_service: true
brew "ripgrep"
brew "ripgrep-all"
brew "scrcpy"
brew "socat"
brew "terminal-notifier"
brew "unar"
brew "universal-ctags"
brew "uutils-coreutils"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "cloudflare/cloudflare/cloudflared"

cask "alt-tab"
cask "android-platform-tools"
cask "leader-key"
cask "loop"
cask "moonlight"
cask "swift-quit"
cask "the-unarchiver"
cask "universal-android-debloater"
cask "vlc"
cask "firefox@nightly"
cask "whisky"
